day = eval(input("오늘이 몇일인지 입력하세요 (1-31): "))
if day >= 25:
    print("안녕하세요 시민 늑대인간입니다")
elif day >= 20:
    print("내가 무슨 짓을 한거야")
elif day >= 15:
    print("아우우우우우")
elif day >= 10:
    print("나쁜 생각이 들어")
elif day >= 5:
    print("고기가 먹고 싶군")
else:
    print("내 몸이 왜 이럴까")

# 오늘이 몇일인지 입력
# 늑대인간의 상태를 출력

# 15일에 늑대인간으로 변한다

# 1일 "내 몸이 왜 이럴까"
# 5일 "고기가 먹고 싶군"
# 10일 "나쁜 생각이 들어"
# 15일 "아우우우우우"
# 20일 "내가 무슨 짓을 한거야"
# 25일 "안녕하세요 시민 늑대인간입니다"

# if 조건 1:
#     조건 1을 만족하는
#     들여쓰기한 처리문 1
# elif 조건 2:
#     조건 2를 만족하는
#     들여쓰기한 처리문 2
# else:
#     조건 1,2를 만족하지 못한
#     들여쓰기한 처리문 3
